In [2]:
import pandas as pd
import numpy as np

In [3]:
path = '/Users/idris/Documents/ds_project/forecast_store_sales/'

In [4]:
df = pd.read_csv(path + '/data/test.csv')

In [5]:
df.head()

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

In [6]:
df.date.nunique()

16

In [7]:
df.date = pd.to_datetime(df.date)
dfts = df.set_index('date')
dfts.columns= ['id', 'bu', 'fam', 'onprom']
dfts['famid'] = pd.factorize(dfts['fam'])[0]
dfts['ts_id'] = dfts['bu'].astype('str') + '_' + dfts['famid'].astype('str')
dfts.head()

                 id  bu         fam  onprom  famid ts_id
date
2017-08-16  3000888   1  AUTOMOTIVE       0      0   1_0
2017-08-16  3000889   1   BABY CARE       0      1   1_1
2017-08-16  3000890   1      BEAUTY       2      2   1_2
2017-08-16  3000891   1   BEVERAGES      20      3   1_3
2017-08-16  3000892   1       BOOKS       0      4   1_4

In [8]:
dfts.ts_id.nunique()

1782

In [9]:
dfts['sales'] = np.nan
dfts = dfts.reset_index()

In [10]:
dfts.head()

        date       id  bu         fam  onprom  famid ts_id  sales
0 2017-08-16  3000888   1  AUTOMOTIVE       0      0   1_0    NaN
1 2017-08-16  3000889   1   BABY CARE       0      1   1_1    NaN
2 2017-08-16  3000890   1      BEAUTY       2      2   1_2    NaN
3 2017-08-16  3000891   1   BEVERAGES      20      3   1_3    NaN
4 2017-08-16  3000892   1       BOOKS       0      4   1_4    NaN

In [11]:
df_export = dfts[['ts_id', 'date', 'id', 'bu', 'famid', 'sales', 'onprom']]
df_export.to_csv('data/testclean.csv', index=False, sep=';')

In [17]:
df_family_detail = dfts[['fam', 'famid']].drop_duplicates()
df_family_detail.to_csv(path +'/data/df_family_detail.csv', index=False, sep=';')